// Function to get the current date
function getCurrentDate() {
    const currentDate = new Date();
    // Use toLocaleDateString with options to set the language to Greek and hide time
    const options = { weekday: 'long', year: 'numeric', month: 'long', day: 'numeric' };
    return currentDate.toLocaleDateString('el-GR', options);
}

// Function to get the day of the year
function getDayOfYear() {
    const currentDate = new Date();
    const startOfYear = new Date(currentDate.getFullYear(), 0, 0);
    const diff = currentDate - startOfYear;
    const oneDay = 24 * 60 * 60 * 1000; // hours * minutes * seconds * milliseconds
    const dayOfYear = Math.floor(diff / oneDay);
    return dayOfYear;
}

// Function to get text based on the day of the year
function getTextBasedOnDate() {
    const dayOfYear = getDayOfYear();

    // Example: Show different messages based on the day of the year
    switch (dayOfYear) { 
        case 1: // 1st January
                     return "1881 - Φεύγει από την ζωή ο Γάλλος σοσιαλιστής και ηγέτης της Παρισινής Κομμούνας Louis Auguste Blanqui.";
     case 2: // 2nd January
                     return  "1965 - Έκρηξη βόμβας στη Νάπολη από CNT, FAI, FIJL." ;
     case 3: // 3rd January
                     return "1937 - Η Emma Goldman ξεκινά να οργανώνει διαφημιστική εκστρατεία για την Ισπανική Επανάσταση." ;
     case 4: // 4rd January
                     return "1960 - Ο Albert Camus πεθαίνει σε αυτοκινητιστικό δυστύχημα.";
     case 5: // 5 January
                     return "1940 - Θάνατος του Ισπανού αναρχικού Francisco Sabaté Llopart μετά από ανταλλαγή πυροβολισμών με την παραστρατιωτική αστυνομία της Πολιτικής Φρουράς.";
     case 6: // 6 January
                     return "1948 - Λήγει η Μάχη της Κόνιτσας μεταξύ του Δημοκρατικού Στρατού Ελλάδας (ΔΣΕ) και του Εθνικού στρατού."
     case 7: // 7 January
                     return "1959 - Οι ΗΠΑ αναγνωρίζουν τη νέα κουβανική κυβέρνηση του Φιντέλ Κάστρο.";
     case 8: // 8 January
                     return "1959 - Ολοκληρώνεται η Κουβανική Επανάσταση με την κατάληψη του Σαντιάγκο ντε Κούμπα από τον Φιντέλ Κάστρο.";
     case 9: // 9 January
                     return "1905 - Η Λουίζ Μισέλ πεθαίνει στη Μασσαλία της Γαλλίας.";
     case 10: // 10 January
                     return "1933 - Ισπανία: Αναρχική εξέγερση στην Ισπανία.";
     case 11: // 11 January
                     return "1929 - Στην ΕΣΣΔ μειώνουν το ημερήσιο ωράριο εργασίας στις 7 ώρες.";
     case 12: // 12 January
                     return "2002 - Αγγλία: Η αναρχική σημαία εμφανίζεται στην πρεσβεία της Αργεντινής.";
     case 13: // 13 January
                     return "1894 - Αναρχική ένοπλη εξέγερση στη Lunigiana της Ιταλίας.";
      case 14: // 14 January
                     return "1918 - Η Έμμα Γκόλντμαν καταδικάζεται σε 2 χρόνια φυλάκιση για παρεμπόδιση του στρατεύματος.";
     case 15: // 15 January
                     return "1919 - Η Ρόζα Λούξεμπουργκ και ο Καρλ Λίμπκνεχτ βασανίζονται και δολοφονούνται από τα Φράικορπς στο τέλος της επανάστασης των Σπαρτακιστών.";
     case 16: // 16 January
                     return "1945 - Ο Αδόλφος Χίτλερ εγκαθίσταται στο υπόγειο καταφύγιό του.";
      case 17: // 17 January
                     return "1945 - Ξεκινά η εκκένωση του στρατοπέδου συγκέντρωσης του Άουσβιτς.";
     case 18: // 18 January
                     return "1989 - Μέλη της 17Ν τραυματίζουν τον αντεισαγγελέα του Αρείου Πάγου Παναγιώτη Ταρασουλέα έξω από το σπίτι του.";
     case 19: // 19 January
                     return "1892 - Διεξάγεται το πρώτο κουβανικό περιφερειακό συνέδριο από Κουβανούς αναρχικούς.";
     case 20: // 20 January
                     return "1930 - Δολοφονείται ο Κορεάτης αναρχικός στρατιωτικός ηγέτης Kim Chwa-chin.";
     case 21: // 21 January
                     return "1924 - Φεύγει από τη ζωή ο ηγέτης της Σοβιετικής Ένωσης, Βλαντιμίρ Λένιν.";
     case 22: // 22rd January
                     return "1937 - Η Emma Goldman ξεκινά να οργανώνει διαφημιστική εκστρατεία για την Ισπανική Επανάσταση.";
     case 23: // 23 January
                     return "1846 - Καταργείται το δουλεμπόριο στην Τυνησία.";
     case 24: // 24 January
                     return "1994 - H 17Ν δολοφονεί τον πρώην διοικητή της Εθνικής Τράπεζας Μιχάλη Βρανόπουλο.";
     case 25: // 25 January
                     return "1919 - Ιδρύεται η Κοινωνία των Εθνών, πρόδρομος του ΟΗΕ.";
     case 26: // 26 January
                     return "1939 - Η Βαρκελώνη πέφτει στον Φράνκο στον Ισπανικό Εμφύλιο Πόλεμο.";
     case 27: // 27 January
                     return "1943 - Η Αμερικανική Πολεμική Αεροπορία βομβαρδίζει το Βιλχελμσχάφεν στη Γερμανία.";
     case 28: // 28 January
                     return "1883 - Καταδίκη του Peter Kropotkin σε πέντε χρόνια φυλάκιση.";
     case 29: // 29 January
                     return "1983 - Η Ελλάδα αναγνωρίζει στις γυναίκες ίσα δικαιώματα, με την αναμόρφωση του οικογενειακού δικαίου.";
     case 30: // 30 January
                     return "1933 - Ο Αδόλφος Χίτλερ ορκίζεται καγκελάριος της Γερμανίας.";
     case 31: // 31 January
                     return "1979 - Η οργάνωση Ιούνης 78 δολοφονεί τον βασανιστή της χούντας Πέτρο Μπάμπαλη.";
     case 32: // 1 Febraury
                     return "1960 - Τέσσερις μαύροι φοιτητές πραγματοποιούν την πρώτη από τις καταλήψεις που θα γίνουν σε εστιατόρια της Βόρειας Καρολίνας.";
     case 33: // 2 Febraury
                     return "1943 - Τερματίζεται η μάχη του Στάλινγκραντ.";
     case 34: // 3 Febraury
                     return "1934 - Ο Γερμανός αναρχικός Erich Mühsam μεταφέρεται στο στρατόπεδο συγκέντρωσης Oranienburg.";
     case 35: // 4 Febraury
                     return "1943 - Εκτελείται από τους Γερμανούς στην Καισαριανή ο Κώστας Περρίκος, αρχηγός της ΠΕΑΝ.";
     case 36: // 5 Febraury
                     return "1911 - Η Γουαδελούπη καταλαμβάνεται από τις επαναστατικές αναρχικές δυνάμεις του Ricardo Flores Magón.";
     case 37: // 6 Febraury
                     return "1919 - Αρχίζει η εξαήμερη Γενική Απεργία του Σιάτλ.";
     case 38: // 7 Febraury
                     return "1946 - Το Ε.Α.Μ. αποφασίζει να μη μετάσχει στις πρώτες βουλευτικές εκλογές και στρέφεται στην ένοπλη εξέγερση.";
     case 39: // 8 Febraury
                     return "1921 - Φεύγει από την ζωή ο γεωγράφος και συγγραφέας Πίτερ Κροπότκιν στο Ντμίτροφ της Ρωσίας.";
     case 40: // 9 Febraury
                     return "1969 - Η Τράπεζα της Ισπανίας στο Λίβερπουλ της Αγγλίας βομβαρδίζεται από την Angry Brigade.";
     case 41: // 10 Febraury
                     return "1939 - Οι Εθνικιστές ολοκληρώνουν την κατάληψη της Καταλονίας και κλείνουν τα σύνορα με τη Γαλλία.";
     case 42: // 11 Febraury
                     return "1990 - Απελευθερώνεται ο Νέλσον Μαντέλα, έπειτα από 27 χρόνια κράτησης στις φυλακές Victor Vester.";
     case 43: // 12 Febraury
                     return "1945 - Υπογράφεται η Συμφωνία της Βάρκιζας μεταξύ της κυβέρνησης του Νικολάου Πλαστήρα και αντιπροσώπων του Ε.Α.Μ.";
     case 44: // 13 Febraury
                     return "1921 - Στη Μόσχα της Ρωσίας, η κηδεία του Peter Kropotkin ήταν η τελευταία δημόσια συγκέντρωση αναρχικών μέχρι την πτώση της Σοβιετικής Ένωσης.";
     case 45: // 14 Febraury
                     return "1936 - Η ισπανική (CNT) εξέδωσε ένα μανιφέστο προειδοποιώντας για ένα εκκρεμές δεξιό πραξικόπημα, πέντε μήνες πριν συμβεί.";
     case 46: // 15 Febraury
                     return "1894 - Ο Γάλλος αναρχικός Martial Bourdin επιχειρεί να καταστρέψει το Βασιλικό Αστεροσκοπείο του Greenwich με μια βόμβα, η οποία εξερράγη στο χέρι του.";
     case 47: // 16 Febraury
                     return "1942 - Ιδρύεται στην Αθήνα ο Ελληνικός Λαϊκός Απελευθερωτικός Στρατός (ΕΛΑΣ).";
     case 48: // 17 Febraury
                     return "1905 - Ο Ivan Kalyayev δολοφονεί τον Δούκα Sergei Alexandrovich της Ρωσίας στη Μόσχα.";
     case 49: // 18 Febraury
                     return "1952 - Η Βουλή των Ελλήνων επικυρώνει την ένταξη της Ελλάδας στο ΝΑΤΟ.";
     case 50: // 19 Febraury
                     return "1919 - Ο Ζωρζ Κλεμανσώ πυροβολήθηκε πέντε φορές από τον αναρχικό Λουί-Εμίλ Κοτίν.";
     case 51: // 20 Febraury
                     return "1933 - Ο Αδόλφος Χίτλερ πραγματοποιεί συνάντηση με Γερμανούς βιομηχάνους με σκοπό τη χρηματοδότηση της επικείμενης προεκλογικής εκστρατείας του Ναζιστικού κόμματος.";
     case 52: // 21 Febraury
                     return "1965 - Δολοφονείται στη Νέα Υόρκη ο Μάλκολμ Χ.";
     case 53: // 22 Febraury
                     return "1943 - Εκτελούνται στη Ναζιστική Γερμανία τρία μέλη της αντιστασιακής οργάνωσης Λευκό Ρόδο.";
     case 54: // 23 Febraury
                     return "1943 - Ιδρύεται η Ενιαία Πανελλαδική Οργάνωση Νέων.";
     case 55: // 24 Febraury
                     return "1939 - Η CNT-FAI ανακοίνωσε ότι θα τερματίσει τις δραστηριότητες στο εξωτερικό.";
     case 56: // 25 Febraury
                     return "1973 - 3.000 φοιτητές οχυρώνονται στη Νομική Σχολή της Αθήνας και διαδηλώνουν από την ταράτσα του κτιρίου κατά της χούντας.";
     case 57: // 26 Febraury
                     return "1920 - Η ιταλική αναρχική εφημερίδα Umanità Nova κάνει το ντεμπούτο της με 50.000 αντίτυπα.";
     case 58: // 27 Febraury
                     return "1913 - Η δίκη της συμμορίας Bonnot τελειώνει με τρεις καταδίκες σε θάνατο.";
     case 59: // 28 Febraury
                     return "2023 - 57 άνθρωποι χάνουν την ζωή τους και δεκάδες άλλοι τραυματίζονται από φονική σύγκρουση δύο τρένων στα Τέμπη.";
     case 60: // 29 Febraury
                     return "1944 - Οι αντιστασιακές οργανώσεις ΕΑΜ-ΕΛΑΣ, ΕΔΕΣ και ΕΚΚΑ υπογράφουν τη Συμφωνία της Πλάκας - Μυρόφυλλου.";
     case 61: // 1 March
                     return "1921 - Ξεσπά η εξέγερση της Κρονστάνδης, οδηγούμενη από τους ναύτες του Στόλου της Βαλτικής και τους ένοπλους πολίτες της Κρονστάνδης.";
     case 62: // 2 March
                     return "1974 - Ο Salvador Puig Antich εκτελείται στη Βαρκελώνη της Ισπανίας.";
     case 63: // 3 March
                     return "1903 - Το Κογκρέσο των ΗΠΑ ψηφίζει τον πρώτο νόμο περί αποκλεισμού των αναρχικών.";
     case 64: // 4 March
                     return "1944 - Αρχίζει η μάχη της Κοκκινιάς.";
     case 65: // 5 March
                     return "1970 - Η Συνθήκη μη Διάδοσης Πυρηνικών Όπλων τίθεται σε ισχύ μετά την επικύρωσή της από 43 κράτη.";
     case 66: // 6 March
                     return "1968 - Η κυβέρνηση του Ιαν Σμιθ στη Ροδεσία απαγχονίζει τρεις μαύρους αγωνιστές της οργάνωσης Λεοπάρδαλη.";
     case 67: // 7 March
                     return "1999 - Πεθαίνει στον ύπνο του από καρδιακή ανακοπή ο σκηνοθέτης Στάνλεϊ Κιούμπρικ.";
     case 68: // 8 March
                     return "2002 - Περισσότεροι από 400 Παλαιστίνιοι συλλαμβάνονται από τον ισραηλινό στρατό.";
     case 69: // 9 March
                     return "1883 - Η Louise Michel ηγείται μιας διαδήλωσης ανέργων και καταδικάζεται σε έξι χρόνια απομόνωση. Αυτή ήταν η πρώτη γνωστή περίπτωση επίδειξης της μαύρης σημαίας.";
     case 70: // 10 March
                     return "1923 - Ο Ισπανός αναρχοσυνδικαλιστής Σαλβαδόρ Σεγκί δολοφονείται στη Βαρκελώνη.";
     case 71: // 11 March
                     return "1907 - Δολοφονείται από αναρχικό ο πρωθυπουργός της Βουλγαρίας, Ντιμίταρ Πέτκοφ.";
     case 72: // 12 March
                     return "1942 - Πεθαίνει σε στρατόπεδο εγκλεισμού Ο Joan Montseny στο Salon-de-Provence της Γαλλίας.";
     case 73: // 13 March
                     return "1957 - Κουβανοί φοιτητές εισβάλουν στο προεδρικό παλάτι στην Αβάνα σε μία προσπάθεια κατά της ζωής του προέδρου Φουλχένσιο Μπατίστα.";
     case 74: // 14 March
                     return "1921 - Μετά από πέντε μήνες φυλάκισης χωρίς κατηγορίες, ο Ερρίκο Μαλατέστα ξεκίνησε απεργία πείνας για να ζητήσει δίκη.";
     case 75: // 15 March
                     return "1995 - Η 17Ν πραγματοποιεί επίθεση με αντιαρματική ρουκέτα εναντίον των εγκαταστάσεων του τηλεοπτικού σταθμού Mega Channel.";
     case 76: // 16 March
                     return "1978 - Οι Ερυθρές Ταξιαρχίες απαγάγουν τον Ιταλό πρωθυπουργό Άλντο Μόρο και λίγες μέρες αργότερα, τον εκτελούν.";
     case 77: // 17 March
                     return "1988 - Δίνει τέλος στη ζωή του ο Νικόλας Άσιμος.";
     case 78: // 18 March
                     return "1871 - Ιδρύεται η Παρισινή Κομμούνα, η οποία αρνείται να υποταχθεί στην εξουσία του Adolphe Thiers.";
     case 79: // 19 March
                     return "1969 - Κατηγορούνται οι Οκτώ του Σικάγο.";
     case 80: // 20 March
                     return "1973 - Κατάληψη της Νομικής Σχολής Αθηνών από φοιτητές ακολούθώντας η επέμβαση της Αστυνομίας με τραυματίες και περισσότερες από 100 συλλήψεις.";
     case 81: // 21 March
                     return "1937 - Κατά τη διάρκεια του Ισπανικού Εμφυλίου Πολέμου, η Σιδηρά Στήλη ψηφίζει να στρατιωτικοποιηθεί.";
     case 82: // 22 March
                     return "1933 - Ανοίγει τις πύλες του το πρώτο ναζιστικό στρατόπεδο συγκέντρωσης στο Νταχάου της Βαυαρίας.";
     case 83: // 23 March
                     return "1919 - Ο Μπενίτο Μουσολίνι ιδρύει το φασιστικό πολιτικό του κίνημα στο Μιλάνο της Ιταλίας.";
     case 84: // 24 March
                     return "1973 - Ο φοιτητής Γεώργιος Παπαγιάννης ρίπτεται από ταράτσα πολυκατοικίας από αγνώστους και σκοτώνεται ενώ οι αρχές το παρουσιάζουν ως αυτοκτονία.";
     case 85: // 25 March
                     return "1965 - Αγωνιστές με επικεφαλής τον Μάρτιν Λούθερ Κινγκ ολοκληρώνουν επιτυχώς την τετραήμερη πορεία τους από τη Σέλμα προς το καπιτώλιο στο Μοντγκόμερι.";
     case 86: // 26 March
                     return "1939 - Ισπανικός Εμφύλιος: Οι Εθνικιστές αρχίζουν την τελική τους επίθεση.";
     case 87: // 27 March
                     return "1993 - Βομβαρδίζονται τα γραφεία του περιοδικού Freedom από φασίστες στο Λονδίνο.";
     case 88: // 28 March
                     return "1849 - Καταδικάζεται ο Γάλλος Pierre-Joseph Proudhon για αντικυβερνητικά γραπτά σε τρία χρόνια φυλάκιση.";
     case 89: // 29 March
                     return "2002 - Το Ισραήλ πραγματοποιεί τη μεγαλύτερη στρατιωτική επιχείρηση εναντίον Παλαιστινίων μαχητών από το 1967.";
     case 90: // 30 March
                     return "1961 - Μονογράφεται η συμφωνία σύνδεσης της Ελλάδας με την Ε.Ο.Κ.";
     case 91: // 31 March
                     return "2017 - Οι Διεθνείς Επαναστατικές Λαϊκές Αντάρτικες Δυνάμεις ιδρύονται στη Ροζάβα.";
     case 92: // 1 April
                     return "1937 - Η Χαέν στην Ισπανία βομβαρδίζεται από γερμανικές φασιστικές δυνάμεις που υποστηρίζουν τους εθνικιστές του Φρανθίσκο Φράνκο.";
     case 93: // 2 April
                     return "1925 - Αποφασίζεται στην Ελλάδα η εφαρμογή του οκταώρου τμηματικά, ανάλογα με την οικονομική κατάσταση των διαφόρων εταιριών.";
     case 94: // 3 April
                     return "2003 - Έξι εργάτες χάνουν τη ζωή τους και άλλοι τρεις τραυματίζονται από ισχυρή έκρηξη στα &#171;Σωληνουργεία Κορίνθου&#187;.";
     case 95: // 4 April
                     return "1968 - Ο Μάρτιν Λούθερ Κινγκ δολοφονείται από τον Τζέημς Ερλ Ρέυ σε ένα μοτέλ στο Μέμφις.";
     case 96: // 5 April
                     return "1895 - Ο Όσκαρ Ουάιλντ συλλαμβάνεται για ομοφυλοφιλία.";
     case 97: // 6 April
                     return "1941 - Η Γερμανία εισβάλλει στην Ελλάδα και τη Γιουγκοσλαβία.";
     case 98: // 7 April
                     return "1933 - Τίθενται σε ισχύ οι πρώτοι νόμοι κατά των Εβραίων στη Γερμανία, γνωστοί ως Νόμοι της Νυρεμβέργης.";
     case 99: // 8 April
                     return "1950 - Ο Ισπανός Josep Lluís i Facerias ανατινάζει ένα αστυνομικό τμήμα στη Βαρκελώνη.";
     case 100: // 9 April
                     return "1927 - Επικυρώνονται οι θανατικές καταδίκες των Sacco και Vanzetti από τον δικαστή Webster Thayer.";
     case 101: // 10 April
                     return "1919 - Ο Μεξικανός αναρχικός Emiliano Zapata σκοτώνεται από μέλη του μεξικανικού στρατού.";
     case 102: // 11 April
                     return "2019 - Συλλαμβάνεται ο εκδότης και ακτιβιστής Julian Assange.";
     case 103: // 12 April
                     return "1904 - Ισπανός αναρχικός αποπειράται να σκοτώσει τον πρωθυπουργό της Ισπανίας Αντόνιο Μάουρα.";
     case 104: // 13 April
                     return "1944 - Οι Γερμανοί πραγματοποιούν το Ολοκαύτωμα του Κωσταραζίου Καστοριάς.";
     case 105: // 14 April
                     return "1874 - Πεθαίνει ο Αμερικανός ατομικιστής αναρχικός Josiah Warren.";
     case 106: // 15 April
                     return "2011 - Η εξέγερση στο Cherán διώχνει καρτέλ, αστυνομία και πολιτικούς, και καθιερώνει την πόλη ως μια αυτοδιοικούμενη κοινότητα.";
     case 107: // 16 April
                     return "1945 - Ο Κόκκινος Στρατός αρχίζει την τελική επίθεση εναντίον των γερμανικών δυνάμεων, με σχεδόν 1.000.000 στρατιώτες να πολεμούν στα Υψώματα Ζέελοβ.";
     case 108: // 17 April
                     return "2006 - Παλαιστίνιος βομβιστής αυτοκτονίας πυροδοτεί εκρηκτικό μηχανισμό σε εστιατόριο του Τελ Αβίβ, σκοτώνοντας 11 ανθρώπους και τραυματίζοντας 66.";
     case 109: // 18 April
                     return "1955 - Φεύγει από την ζωή ο γερμανός φυσικός Άλμπερτ Αϊνστάιν.";
     case 110: // 19 April
                     return "1961 - Αποτυγχάνει η αμερικανικής εμπνεύσεως &#171;Επιχείρηση του Κόλπου των Χοίρων&#187;, που ως σκοπό είχε την ανατροπή του Φιντέλ Κάστρο.";
     case 111: // 20 April
                     return "2001 - Ξεκινά η Μαύρη Άνοιξη, μετά τη δολοφονία της φοιτήτριας Massinissa Guermah από την αλγερινή αστυνομία.";
     case 112: // 21 April
                     return "1967 - Ο Στυλιανός Παττακός ηγείται πραξικοπήματος, εγκαθιδρύοντας στρατιωτικό καθεστώς που θα διαρκέσει επτά χρόνια.";
     case 113: // 22 April
                     return "1906 - Ιδρύεται η Περιφερειακή Εργατική Ομοσπονδία της Παραγουάης.";
     case 114: // 23 April
                     return "1944 - Οι Γερμανοί εισβάλουν στους Πύργους Κοζάνης και πυρπολούν το χωριό.";
     case 115: // 24 April
                     return "1892 - Ο Théodule Miller βομβαρδίζει το εστιατόριο στο οποίο ο Ravachol είχε υποδειχθεί στην αστυνομία.";
     case 116: // 25 April
                     return "1945 - Ο ναζιστικός στρατός κατοχής παραδίνεται και αφήνει τη βόρεια Ιταλία ενώ ο Μπενίτο Μουσολίνι συλλαμβάνεται.";
     case 117: // 26 April
                     return "1986 - Σημειώνεται έκρηξη στον Πυρηνικό Σταθμό του Τσερνόμπιλ.";
     case 118: // 27 April
                     return "1898 - Ολοκληρώνεται η δίκη του Ερρίκο Μαλατέστα, βρίσκοντας όλα τα μέλη ένοχα.";
     case 119: // 28 April
                     return "1945 - Ο Μπενίτο Μουσολίνι και η ερωμένη του συλλαμβάνονται και εκτελούνται από μέλη του Ιταλικού Κινήματος Αντίστασης.";
     case 120: // 29 April
                     return "1945 - Ο Αδόλφος Χίτλερ παντρεύεται την επί χρόνια σύντροφό του, Εύα Μπράουν και αυτοκτονούν την επόμενη ημέρα.";
     case 121: // 30 April
                     return "1971 - Ο φοιτητής Νίκος Ρουκουνάκης αυτοπυρπολείται στην πανεπιστημιούπολη Θεσσαλονίκης και χάνει τη ζωή του, ως διαμαρτυρία κατά της Χούντας.";
     case 122: // 1 May
                     return "1886 - Στις Ηνωμένες Πολιτείες Αμερικής πραγματοποιούνται συλλαλητήρια διεκδικώντας το οκτάωρο καθώς και καλύτερες συνθήκες στην εργασία.";
     case 123: // 2 May
                     return "1945 - Πτώση του Βερολίνου. Οι Σοβιετικοί στρατιώτες καταλαμβάνουν το κτήριο του Ράιχσταγκ.";
     case 124: // 3 May
                     return "1849 - Ο Μιχαήλ Μπακούνιν συμμετέχει στην εξέγερση του Μάη στη Δρέσδη.";
     case 125: // 4 May
                     return "1967 - Η χούντα εκτοπίζει 6.000 αντικαθεστωτικούς Γυάρο.";
     case 126: // 5 May
                     return "2010 - Μεγάλη απεργία στην Ελλάδα κατά της υπογραφής μνημονίου με το ΔΝΤ και την ΕΕ για την αποτροπή της χρεοκοπίας.";
     case 127: // 6 May
                     return "1916 - Ο Αλεξάντερ Μπέρκμαν ιδρύει την No Conscription League.";
     case 128: // 7 May
                     return "1953 - Ιδρύεται η Κεντρική Υπηρεσία Πληροφοριών (ΚΥΠ) η οποία μετέπειτα θα μετονομαστεί σε Εθνική Υπηρεσία Πληροφοριών (ΕΥΠ).";
     case 129: // 8 May
                     return "1936 - Ο Μάης του 36 στη Θεσσαλονίκη. Σε διαδήλωση καπνεργατών σκοτώνονται 12 και τραυματίζονται 282 διαδηλωτές εργάτες.";
     case 130: // 9 May
                     return "1976 - Η Ούλρικε Μάινχοφ βρίσκεται κρεμασμένη στο κελί 719 των φυλακών υψίστης ασφαλείας στο Στάμχαϊμ.";
     case 131: // 10 May
                     return "1933 - Μέλη του Ναζιστικού Κόμματος καίνε βιβλία των Μαρξ, Φρόιντ, Μπρεχτ και Αϊνστάιν.";
     case 132: // 11 May
                     return "1894 - Μεγάλη απεργία στο εργοστάσιο κατασκευής βαγονιών &#171;Πούλμαν&#187; στο Ιλινόις.";
     case 133: // 12 May
                     return "1946 - Ιδρύεται στο Τόκιο η Ιαπωνική Αναρχική Ομοσπονδία.";
     case 134: // 13 May
                     return "1940 - Ξεκινά η κατάκτηση της Γαλλίας από τους Γερμανούς.";
     case 135: // 14 May
                     return "1940 - Φεύγει από την ζωή η Έμμα Γκόλντμαν στο Τορόντο του Καναδά.";
     case 136: // 15 May
                     return "1941 - Ιδρύεται η Ελευθερία, πρώτη αντιστασιακή οργάνωση στην Ελλάδα.";
     case 137: // 16 May
                     return "1909 - Φυλακίζεται Ο Μεξικανός αναρχικός Ρικάρντο Φλόρες Μαγκόν για 18 μήνες.";
     case 138: // 17 May
                     return "1968 - Εισβάλλουν σε γραφείο επιμελητών στο Catonsville ο Φίλιππος και ο Ντάνιελ Μπέριγκαν, καίγοντας πάνω από 600 πρόχειρα αρχεία.";
     case 139: // 18 May
                     return "1827 - Ο Josiah Warren ανοίγει το πρώτο του Time Store στο Σινσινάτι του Οχάιο για να δοκιμάσει την οικονομική του εργασιακή θεωρία της αξίας.";
     case 140: // 19 May
                     return "1904 - Γεννιέται ο Γάλλος συγγραφέας Ντανιέλ Γκερέν.";
     case 141: // 20 May
                     return "1945 - Πεθαίνει ο Γερμανός αναρχοσυνδικαλιστής Φριτς Κάτερ μετά από 12 ημέρες στο νοσοκομείο.";
     case 142: // 21 May
                     return "1894 - Ο Γάλλος αναρχικός Émile Henry εκτελείται με γκιλοτίνα.";
     case 143: // 22 May
                     return "1894 - Ξεκινά η δίκη του Λουίτζι Γκαλεάνι για συνωμοσία στη Γένοβα της Ιταλίας.";
     case 144: // 23 May
                     return "1945 - Ο επικεφαλής της Schutzstaffel, Χάινριχ Χίμλερ, αυτοκτονεί ενώ τελεί υπό κράτηση από τους συμμάχους.";
     case 145: // 24 May
                     return "1968 - Φοιτητές βάζουν φωτιά στο Χρηματιστήριο του Παρισιού.";
     case 146: // 25 May
                     return "1926 - Ο Εβραίος αναρχικός Sholom Schwartzbard δολοφονεί τον Symon Petliura τον οποίο κατηγόρεί για το θάνατο 15 μελών της οικογένειάς του στα πογκρόμ στην Ουκρανία.";
     case 147: // 26 May
                     return "1926 - Κατατίθεται αγωγή για να ξαναδικαστεί ο Sacco και ο Vanzetti αφού κάποιος άλλος ομολογεί το έγκλημα.";
     case 148: // 27 May
                     return "1963 - Δολοφονείται ο Γρηγόρης Λαμπράκης στη Θεσσαλονίκη.";
     case 149: // 28 May
                     return "1871 - Συντρίβεται η Παρισινή Κομμούνα.";
     case 150: // 29 May
                     return "1897 - Άφιξη του Rudolf Rocker και Milly Witkop στις Ηνωμένες Πολιτείες, λίγες μέρες πριν αναγκαστούν να εγκαταλείψουν τη χώρα επειδή αρνήθηκαν να παντρευτούν.";
     case 151: // 30 May
                     return "1925 - Κίνα: Ξεσπούν αντιιμπεριαλιστικές διαδηλώσεις στον Διεθνή Διακανονισμό της Σαγκάης.";
     case 152: // 31 May
                     return "1982 - Οι Καναδοί αναρχικοί Direct Action ανατινάζουν έναν υποσταθμό BC υδροηλεκτρικής ενέργειας.";
     case 153: // 1 June
                     return "1998 - Ιδρύεται η Ευρωπαϊκή Κεντρική Τράπεζα με έδρα στη Φρανκφούρτη.";
     case 154: // 2 June
                     return "1919 - Αναρχικοί επηρεασμένοι από τον Λουίτζι Γκαλεάνι πραγματοποιούν μια σειρά συντονισμένων βομβαρδισμών στις ανατολικές Ηνωμένες Πολιτείες.";
     case 155: // 3 June
                     return "1979 - Η Ισπανίδα αναρχική Gladys Gogoan δολοφονείται από την Πολιτική Φρουρά κατά τη διάρκεια διαδηλώσεων στην Tudela.";
     case 156: // 4 June
                     return "1919 - Ο Νέστορ Μαχνό κηρύσσεται παράνομος από την κυβέρνηση των Μπολσεβίκων.";
     case 157: // 5 June
                     return "1951 - Ανασυστήνεται η Ιαπωνική Αναρχική Ομοσπονδία.";
     case 158: // 6 June
                     return "1911 - Η μεξικανική κυβέρνηση λαμβάνει την άδεια των ΗΠΑ να στείλει στρατεύματα στη Μπάχα για να εισβάλουν σε αυτόνομες κοινότητες.";
     case 159: // 7 June
                     return "1954 - Ο Άλαν Τούρινγκ βρέθηκε νεκρός στο κρεβάτι του με την επίσημη έρευνα θανάτου να καθορίζει το θάνατο ως αυτοκτονία.";
     case 160: // 8 June
                     return "2000 - Η 17 Νοέμβρη δολοφονεί τον Βρετανό στρατιωτικό ακόλουθο Στήβεν Σόντερς στη λεωφόρο Κηφισίας.";
     case 161: // 9 June
                     return "1902 - Η πολιτεία της Ουάσιγκτον ψηφίζει αντιαναρχικό νόμο.";
     case 162: // 10 June
                     return "1944 - Σφαγή του Διστόμου. Γερμανικά στρατεύματα δολοφονούν 228 άνδρες, γυναίκες και παιδιά στο Δίστομο Βοιωτίας.";
     case 163: // 11 June
                     return "2001 - Ο Jeff Luers καταδικάζεται σε 22 χρόνια για το κάψιμο 3 SUV.";
     case 164: // 12 June
                     return "1900 - Φεύγει από την ζωή ο Τουρκικής καταγωγής αναρχικός Jules Regis.";
     case 165: // 13 June
                     return "1982 - Φεύγει από την ζωή ο Γάλλος αναρχικός, καλλιτέχνης και δάσκαλος André Claudot.";
     case 166: // 14 June
                     return "2023 - Πολύνεκρο ναυάγιο στην Πύλο με 82 νεκρούς και εκατοντάδες άλλους να αγνοούνται.";
     case 167: // 15 June
                     return "1945 - Δίνει τέλος στην ζωή του ο ηγέτης του ΕΛΑΣ Άρης Βελουχιώτης.";
     case 168: // 16 June
                     return "2000 - Οι αναρχικοί ακτιβιστές Jeff Luers και Craig Marshall συλλαμβάνονται στο Όρεγκον για εμπρησμό.";
     case 169: // 17 June
                     return "1906 - Ο Alexander Berkman αποφυλακίζεται για την απόπειρα δολοφονίας του βιομήχανου Henry Clay Frick.";
     case 170: // 18 June
                     return "1923 - Πανεθνική Γενική Απεργία για τη δολοφονία του αναρχικού Kurt Wilckens στο κελί της φυλακής του, παραλύει την Αργεντινή.";
     case 171: // 19 June
                     return "1997 - Μπάτσοι εισβάλλουν σε κέντρα και σπίτια αναρχικών σε όλη την Ιταλία. Η Ιταλική Αναρχική Ομοσπονδία κατήγγειλε τις επιδρομές ως μια λεπτή συγκαλυμμένη προσπάθεια εκφοβισμού και ποινικοποίησης του κινήματος.";
     case 172: // 20 June
                     return "1912 - Φεύγει από την ζωή η Voltairine de Cleyre.";
     case 173: // 21 June
                     return "1917 - Η Έμμα Γκόλντμαν αφήνετε ελεύθερη με εγγύηση 25.000 δολαρίων για την αντιπολεμική της δράση.";
     case 174: // 22 June
                     return "1914 - Βόμβα που προοριζόταν για την έπαυλη Ροκφέλερ πυροδοτείται ακούσια σκοτώνοντας τρεις αναρχικούς.";
     case 175: // 23 June
                     return "1883 - Η Louise Michel καταδικάζεται σε εξαετή φυλάκιση μαζί με 10 χρόνια παρακολούθησης όταν πολλά αρτοποιεία λεηλατήθηκαν κατά τη διάρκεια διαδήλωσης.";
     case 176: // 24 June
                     return "2010 - Έκρηξη ταχυδρομικής βόμβας στο υπουργικό γραφείο του υπουργού Προστασίας του Πολίτη Μιχάλη Χρυσοχοΐδη.";
     case 177: // 25 June
                     return "1947 - Εκδίδεται το Ημερολόγιο της Άννας Φρανκ.";
     case 178: // 26 June
                     return "1938 - Πεθαίνει ο στοιχειοθέτης Thomas H. Keell που επιμελήθηκε το αναρχικό περιοδικό Freedom.";
     case 179: // 27 June
                     return "1960 - Φεύγει από την ζωή ο Γάλλος συνδικαλιστής Pierre Monatte.";
     case 180: // 28 June
                     return "1936 - Ο Αλεξάντερ Μπέρκμαν πεθαίνει από αυτοτραυματισμό στη Νίκαια της Γαλλίας.";
     case 181: // 29 June
                     return "2002 - Συλλαμβάνεται έπειτα από έκρηξη στον Πειραιά ο Σάββας Ξηρός. Αφετηρία για την εξάρθρωση της 17 Νοέμβρη.";
     case 182: // 30 June
                     return "1874 - Γεννήθηκε ο γιατρός, ελευθεριακός σοσιαλιστής και συγγραφέας Fritz Brupbacher.";
     case 183: // 1 July
                     return "1876 - Φεύγει από την ζωή ο Ρώσος αναρχικός επαναστάτης Μιχαήλ Μπακούνιν.";
     case 184: // 2 July
                     return "1926 - Η γαλλική αστυνομία ανακοινώνει ότι ματαίωσε σχέδιο δολοφονίας του βασιλιά της Ισπανίας με τις συλλήψεις των Ισπανών αναρχικών Francisco Ascaso, Buenaventura Durruti και Gregorio Jover";
     case 185: // 3 July
                     return "1933 - Οι Ναζί αρχίζουν να διώχνουν τους Εβραίους από τις δημόσιες υπηρεσίες της Γερμανίας.";
     case 186: // 4 July
                     return "1914 - Πραγματοποιείται βομβιστική επίθεση στη Λεωφόρο Λέξινγκτον στη Νέα Υόρκη.";
     
     case 187: // 5 July
                     return "2015 - Συντριπτική υπεροχή του ΟΧΙ στο δημοψήφισμα για την πρόταση των δανειστών της 25ης Ιουνίου.";
     case 188: // 6 July
                     return "1934 - Φεύγει από την ζωή ο Ουκρανός αναρχικός επαναστάτης Νέστορ Μάχνο.";
     case 189: // 7 July
                     return "1936 - Γεννιέται ο τραγουδιστής Νίκος Ξυλούρης.";
     case 190: // 8 July
                     return "1963 - Οι ΗΠΑ επιβάλλουν εμπάργκο στην Κούβα.";
     case 191: // 9 July
                     return "1917 - Δολοφονείται ο Antonio Martinez κατά τη διάρκεια απεργίας από αστυνομικούς.";
     case 192: // 10 July
                     return "1943 - Ολοκαύτωμα Κεφαλόβρυσου Ιωαννίνων από τη Ναζιστική Γερμανία με 22 θύματα, που κάηκαν ζωντανοί.";
     case 193: // 11 July
                     return "1918 - Ο εργάτης αναρχικός Simón Radowitzky δραπετεύει από το στρατόπεδο συγκέντρωσης Ushuaia στο νησί Tierra del Fuego.";
     case 194: // 12 July
                     return "1944 - Αρχίζει η μάχη της Αμφιλοχίας μεταξύ του ΕΛΑΣ και γερμανικών δυνάμεων.";
     case 195: // 13 July
                     return "1952 - Φεύγει από την ζωή η Αμερικανή γιατρός Marie Equi.";
     case 196: // 14 July
                     return "1933 - Αρχίζει η ναζιστική ευγονική που απαιτεί την υποχρεωτική στείρωση κάθε πολίτη που πάσχει από υποτιθέμενες γενετικές διαταραχές.";
     case 197: // 15 July
                     return "1918 - Οι υπηρεσίες πληροφοριών αρχίζουν να κυκλοφορούν τα ονόματα και τις διευθύνσεις περισσότερων από 8.000 συνδρομητών του περιοδικού Mother Earth, στοχεύοντάς τους για έρευνα.";
     case 198: // 16 July
                     return "1945 - Πρόγραμμα Μανχάταν: Αρχίζει η Ατομική Εποχή όταν οι Ηνωμένες Πολιτείες Αμερικής πραγματοποιούν δοκιμή έκρηξης πυρηνικού όπλου κοντά στο Αλαμογκόρντο του Νέου Μεξικού.";
     case 199: // 17 July
                     return "1936 - Μια στρατιωτική εξέγερση στην Ισπανία ξεκινά τον Ισπανικό Εμφύλιο Πόλεμο.";
     case 200: // 18 July
                     return "1925 - Εκδίδεται Ο Αγών μου του Αδόλφου Χίτλερ.";
     case 201: // 19 July
                     return "2012 - Οι Μονάδες Προστασίας του Λαού (YPG) καταλαμβάνουν την πόλη Κομπάνι, ξεκινώντας την Επανάσταση της Ροζάβα στη Βόρεια και Ανατολική Συρία.";
     case 202: // 20 July
                     return "2001 - Η αστυνομία σκοτώνει τον αναρχικό Carlo Giuliani σε διαμαρτυρία ενάντια στη συνεδρίαση της G8 στη Γένοβα της Ιταλίας.";
     case 203: // 21 July
                     return "1936 - Ιδρύεται η Κεντρική Επιτροπή των Αντιφασιστικών Πολιτοφυλακών της Καταλονίας, ξεκινώντας τη δημιουργία μιας αναρχοσυνδικαλιστικής κοινωνίας στην Καταλονία.";
     case 204: // 22 July
                     return "1932 - Ο Ερρίκο Μαλατέστα, Ιταλός αναρχικός, πεθαίνει μετά από 6 χρόνια σε κατ&#39;οίκον περιορισμό.";
     case 205: // 23 July
                     return "1892 - Ο Alexander Berkman επιχειρεί να δολοφονήσει τον Henry Clay Frick στο Πίτσμπουργκ της Πενσυλβάνια.";
     case 206: // 24 July
                     return "1909 - Ιδρύεται στην τουρκοκρατούμενη Θεσσαλονίκη η Σοσιαλιστική Εργατική Ομοσπονδία, γνωστή και ως Φεντερασιόν.";
     case 207: // 25 July
                     return "1909 - Αρχίζει η Τραγική Εβδομάδα, μια σειρά αιματηρών συγκρούσεων μεταξύ του ισπανικού στρατού και των εργατικών τάξεων των πόλεων της Καταλονίας.";
     case 208: // 26 July
                     return "1908 - Ιδρύεται στην Ουάσιγκτον το Ομοσπονδιακό Γραφείο Ερευνών, γνωστότερο ως FBI.";
     case 209: // 27 July
                     return "1794 - Συλλαμβάνεται ο Μαξιμιλιανός Ροβεσπιέρος μετά την ενθάρρυνση της εκτέλεσης περισσότερων από 17.000 εχθρών της επανάστασης.";
     case 210: // 28 July
                     return "2005 - Η οργάνωση Ιρλανδικός Δημοκρατικός Στρατός ανακοινώνει τον τερματισμό του ένοπλου αγώνα εναντίον της Βρετανικής παρουσίας στη Βόρειο Ιρλανδία.";
     case 211: // 29 July
                     return "1900 - Ο Γκαετάνο Μπρέσι δολοφονεί τον Ιταλό βασιλιά Ουμβέρτο Α&#39; στη Μόντσα της Ιταλίας.";
     case 212: // 30 July
                     return "2006 - Φεύγει από την ζωή ο αναρχικός και θεωρητικός της κοινωνικής οικολογίας Murray Bookchin.";
     case 213: // 31 July
                     return "1963 - Οι Ισπανοί αναρχικοί Francisco Granados και Joaquín Delgado συλλαμβάνονται για εγκλήματα που δεν διέπραξαν και αργότερα εκτελούνται.";
     case 214: // 1 August
                     return "1944 - Ξεσπά η Εξέγερση της Βαρσοβίας κατά της ναζιστικής κατοχής, στη Βαρσοβία της Πολωνίας.";
     case 215: // 2 August
                     return "1909 - Η Τραγική Εβδομάδα, μια σειρά από αιματηρές αντιπαραθέσεις μεταξύ του στρατού και των εργατικών τάξεων της Καταλονίας, τερματίζεται όταν τα στρατεύματα συντρίβουν την εξέγερση.";
     case 216: // 3 August
                     return "1910 - Ελευθερώνεται από τη φυλακή ο Μεξικανός αναρχικός Ricardo Flores Magón.";
     case 217: // 4 August
                     return "1936 - Αρχίζει η περίοδος της δικτατορίας του Ιωάννη Μεταξά.";
     case 218: // 5 August
                     return "1895 - Φεύγει από την ζωή ο Γερμανός φιλόσοφος Φρίντριχ Ένγκελς.";
     case 219: // 6 August
                     return "1894 - Αρχίζει στο Παρίσι η δίκη των τριάντα, μια αντιαναρχική δίκη με στόχο τη ψήφιση των νόμων lois scélérates.";
     case 220: // 7 August
                     return "1999 - Τρία μέλη της Silvestre συλλαμβάνονται και κατηγορούνται για πυρκαγιές σε πολυεθνικές εταιρείες στην Πίζα της Ιταλίας.";
     case 221: // 8 August
                     return "1918 - Φεύγει από την ζωή ο Γάλλος δημοσιογράφος, μυθιστοριογράφος, εκδότης, σκηνοθέτης και αντικληρικός Μισέλ Ζεβακό.";
     case 222: // 9 August
                     return "1945 - Αμερικανικό βομβαρδιστικό ρίχνει ατομική βόμβα στο Ναγκασάκι, σκοτώνοντας 35.000 άτομα.";
     case 223: // 10 August
                     return "1923 - Ο Ιταλοαμερικανός Κάρλο Τρέσκα συλλαμβάνεται στις Ηνωμένες Πολιτείες με την κατηγορία της δημοσίευσης αντιφασιστικής λογοτεχνίας.";
     case 224: // 11 August
                     return "1964 - Συλλαμβάνεται στη Μαδρίτη της Ισπανίας ο Στιούαρτ Κρίστι κατά την απόπειρα δολοφονίας του Φρανσίσκο Φράνκο.";
     case 225: // 12 August
                     return "1861 - Γεννιέται ο Ιταλός αναρχικός Λουίτζι Γκαλεάνι.";
     case 226: // 13 August
                     return "1882 - Το Bande Noire, που αποτελείται από αναρχικούς εργάτες ορυχείων, επιτίθεται στον κληρικαλισμό κλέβοντας θρησκευτικά αντικέιμενα.";
     case 227: // 14 August
                     return "1994 - Συλλαμβάνεται στο Σουδάν ο Κάρλος το Τσακάλι και εκδίδεται στη Γαλλία.";
     case 228: // 15 August
                     return "1965 - Ιδρύεται το Movimiento de Izquierda Revolucionaria (MIR) στη Χιλή.";
     case 229: // 16 August
                     return "1936 - Σε κεντρικές πλατείες ελληνικών πόλεων καίγονται βιβλία από τη δικτατορία Μεταξά. Ανάμεσά τους, βιβλία των Γκαίτε, Σω, Φρόιντ, Τολστόι.";
     case 230: // 17 August
                     return "2005 - Ξεκινάει από το Ισραήλ η εκκένωση της λωρίδας της Γάζας από εβραίους εποίκους.";
     case 231: // 18 August
                     return "1925 - Φεύγει από την ζωή ο Γεωργιανός πρίγκιπας, αναρχικός αγωνιστής και συνεργάτης του Πίτερ Κροπότκιν Warlaam Tcherkesoff στο Λονδίνο.";
     case 232: // 19 August
                     return "1903 - Ιδρύεται στην ανατολική Θράκη η Strandzha Commune.";
     case 233: // 20 August
                     return "1940 - Ο εξόριστος στο Μεξικό Λέων Τρότσκι τραυματίζεται θανάσιμα με ορειβατική αξίνα από τον Ραμόν Μερκαντέρ και πεθαίνει την επόμενη ημέρα.";
     case 234: // 21 August
                     return "1967 - Συλλαμβάνεται και φυλακίζεται από την χούντα ο συνθέτης Μίκης Θεοδωράκης.";
     case 235: // 22 August
                     return "1923 - Η μεγαλύτερη απεργία στην Ελλάδα καταστέλλεται βίαια από στρατό και αστυνομία με 11 νεκρούς και δεκάδες τραυματίες.";
     case 236: // 23 August
                     return "1927 - Εκτελούνται στη Βοστόνη οι αναρχικοί Νίκολας Σάκο και Μπαρτολομέο Βαντσέτι.";
     case 237: // 24 August
                     return "1907 - Ξεκινά το Διεθνές Αναρχικό Συνέδριο του Άμστερνταμ, συγκεντρώνοντας αντιπροσώπους από 14 χώρες.";
     case 238: // 25 August
                     return "1949 - Ο Εθνικός Στρατός εξαπολύει την τελική επίθεσή του στον Γράμμο εναντίον των ανταρτών του ΔΣΕ.";
     case 239: // 26 August
                     return "1937 - Το Διαεπαρχιακό Συμβούλιο του Σανταντέρ, της Παλένθια και του Μπούργκος διαλύεται με την Άλωση του Σανταντέρ και οι Ρεπουμπλικάνοι αρχίζουν να εκκενώνουν την Κανταβρία.";
     case 240: // 27 August
                     return "1927 - Παρίσι: Χιλιάδες συμμετέχουν σε βίαιες διαδηλώσεις για τους θανάτους των Sacco και Vanzetti.";
     case 241: // 28 August
                     return "1963 - Κατά τη διάρκεια πορείας υπέρ των δικαιωμάτων των μαύρων στην Ουάσιγκτον ο Μάρτιν Λούθερ Κινγκ εκφωνεί τον περίφημο λόγο του I have a dream.";
     case 242: // 29 August
                     return "2003 - Το Μέτωπο Απελευθέρωσης της Γης βάφει με σπρέι τοίχους και κατασκευαστικό εξοπλισμό σε εργοτάξιο στο Fairbanks της Αλάσκας.";
     case 243: // 30 August
                     return "1957 - Δολοφονείται από την ισπανική αστυνομία ο Josep Lluís i Facerias.";
     case 244: // 31 August
                     return "1923 - Οι Ιταλοί βομβαρδίζουν και καταλαμβάνουν την Κέρκυρα.";
     case 245: // 1 September
                     return "1920 - Ιταλοί μεταλλουργοί ξεκινούν τετραήμερη κατάληψη των εργοστασίων τους.";
     case 246: // 2 September
                     return "1867 - Η Διεθνής Ένωση Εργατών ξεκινά το δεύτερο συνέδριό της στη Λωζάνη της Ελβετίας.";
     case 247: // 3 September
                     return "1962 - Η FAI επικυρώνει το συνέδριο της CNT εγκρίνοντας έτσι ένα μυστικό τμήμα Εσωτερικής Άμυνας με στόχο την άμεση δράση κατά του καθεστώτος του Φράνκο.";
     case 248: // 4 September
                     return "1970 - Ο Σαλβαδόρ Αλιέντε εκλέγεται πρόεδρος της Χιλής";
     case 249: // 5 September
                     return "2002 - Παραδίδεται στη Γενική Αστυνομική Διεύθυνση Αττικής ο Δημήτριος Κουφοντίνας.";
     case 250: // 6 September
                     return "1877 - Η Αναρχική Διεθνής ξεκινά το τελευταίο της συνέδριο στο Verviers της Ελβετίας.";
     case 251: // 7 September
                     return "1872 - Ο Μιχαήλ Μπακούνιν αποβάλλεται από τη Διεθνή Ένωση Εργατών κατά τη διάρκεια του Συνεδρίου της Χάγης.";
     case 252: // 8 September
                     return "1911 - Ιδρυτικό συνέδριο της Ισπανικής αναρχοσυνδικαλιστικής Εθνικής Συνομοσπονδίας Εργασίας (CNT).";
     case 253: // 9 September
                     return "1861 - Το πρώτο μέρος του άρθρου Aναρχία δημοσιεύεται στην εφημερίδα Φως και θεωρείται το πρώτο αναρχικό δημοσίευμα στον τότε ελλαδικό χώρο. Η εφημερίδα διώκεται και το φύλλο κατάσχεται.";
     case 254: // 10 September
                     return "1898 - Ο Λουίτζι Λουτσένι δολοφονεί την Αυστριακή αυτοκράτειρα Ελισάβετ της Βαυαρίας.";
     case 255: // 11 September
                     return "2001 - Δύο επιβατικά αεροσκάφη προσκρούουν στους δίδυμους πύργους του Παγκοσμίου Κέντρου Εμπορίου στη Νέα Υόρκη. Ένα ακόμα αεροπλάνο προσκρούει στο Πεντάγωνο και ένα συντρίβεται στην ύπαιθρο της Πενσυλβάνια.";
     case 256: // 12 September
                     return "1922 - Γεννιέται ο Αμερικανός αναρχικός ποιητής Τζάκσον Μακ Λοου.";
     case 257: // 13 September
                     return "1919 - Ιδρύεται η Γενική Συνομοσπονδία Εργασίας, ένα πορτογαλικό αναρχικό συνδικάτο.";
     case 258: // 14 September
                     return "1867 - Ο Καρλ Μαρξ εκδίδει το Κεφάλαιο.";
     case 259: // 15 September
                     return "1923 - Δολοφονείται από Ιάπωνες στρατιώτες ο Osugi Sakae.";
     case 260: // 16 September
                     return "1872 - Ιδρύεται η Αναρχική Διεθνής στο Συνέδριο του St. Imier.";
     case 261: // 17 September
                     return "1982 - Φεύγει από την ζωή ο συνθέτης Μάνος Λοΐζος.";
     case 262: // 18 September
                     return "2013 - Δολοφονείται ο Παύλος Φύσσας από τον Γιώργο Ρουπακιά, μέλος της Χρυσής Αυγής.";
     case 263: // 19 September
                     return "1958 - Φεύγει από την ζωή ο Γερμανός αναρχοσυνδικαλιστής Ρούντολφ Ρόκερ.";
     case 264: // 20 September
                     return "1942 - Λαμβάνει χώρα η Ανατίναξη των γραφείων της ΕΣΠΟ στην Αθήνα κατά τη διάρκεια της Κατοχής.";
     case 265: // 21 September
                     return "1921 - Ο Ρώσος ατομικιστής αναρχικός Λεβ Τσέρνι εκτελείται χωρίς δίκη από την Τσέκα.";
     case 266: // 22 September
                     return "1973 - Συλλαμβάνεται ο Ισπανός αναρχικός αγωνιστής Σαλβαδόρ Πουίγκ Αντίτς και αργότερα εκτελείται επειδή πολέμησε το καθεστώς του Φράνκο.";
     case 267: // 23 September
                     return "1942 - Αρχίζουν πειραματικά στο Άουσβιτς οι εκτελέσεις Εβραίων με θανατηφόρα αέρια.";
     case 268: // 24 September
                     return "1919 - Ο ουκρανικός αναρχικός Μαύρος Στρατός νικά τον Λευκό Στρατό του στρατηγού Ντενίκιν, οδηγώντας στη συντριπτική ήττα του.";
     case 269: // 25 September
                     return "1915 - Κατά τη διάρκεια του Α Παγκοσμίου Πολέμου, αρχίζει η τρίτη μάχη της Αρτουά, στην οποία χρησιμοποιούνται για πρώτη φορά δηλητηριώδη αέρια κατά των Γερμανών.";
     case 270: // 26 September
                     return "1989 - Η 17 Νοέμβρη δολοφονεί τον Παύλο Μπακογιάννη έξω απο το γραφείο του.";
     case 271: // 27 September
                     return "1913 - Έναρξη του Πρώτου Διεθνούς Συνδικαλιστικού Συνεδρίου στο Λονδίνο.";
     case 272: // 28 September
                     return "2000 - Αρχίζει η δεύτερη Ιντιφάντα των Παλιστινίων, με αφορμή την προκλητική επίσκεψη του Αριέλ Σαρόν στα κατεχόμενα.";
     case 273: // 29 September
                     return "1941 - 30.000 Εβραίοι και άλλοι ανεπιθύμητοι εκτελούνται στο φαράγγι Μπάμπι Γιαρ του Κιέβου, με διαταγή του Χίμλερ.";
     case 274: // 30 September
                     return "1918 - Οι Ουκρανοί αντάρτες, με επικεφαλής τον Νέστορα Μάχνο και τον Φεντίρ Σχους, νικούν τον Αυστροουγγρικό Στρατό στη μάχη της Ντιμπρίβκα.";
     case 275: // 1 October
                     return "1946 - Εκδίδεται η απόφαση στη δίκη της Νυρεμβέργης και 12 από τους 22 εξέχοντες Ναζί καταδικάζονται σε θάνατο ως εγκληματίες πολέμου.";
     case 276: // 2 October
                     return "1941 - Επιχείρηση Μπαρμπαρόσα: Η ναζιστική Γερμανία ξεκινά επιθετική ενέργεια για να καταλάβει τη Μόσχα.";
     case 277: // 3 October
                     return "1993 - Δίνει τέλος στην ζωή της η ποιήτρια και ηθοποιός Κατερίνα Γώγου.";
     case 278: // 4 October
                     return "2006 - Ιδρύεται ο ιστότοπος Wikileaks.";
     case 279: // 5 October
                     return "1789 - Γαλλική Επανάσταση: Οι γυναίκες του Παρισιού πραγματοποιούν πορεία για να έρθουν αντιμέτωπες με τον Λουδοβίκο ΙΣΤ της Γαλλίας σχετικά με την άρνησή του να εκδώσει τα διατάγματα κατάργησης της Φεουδαρχίας, ζητούν ψωμί και υποχρεώνουν τον βασιλιά και την αυλή του να μεταφερθούν στο Παρίσι.";
     case 280: // 6 October
                     return "2004 - Αθώος κρίνεται ο κατηγορούμενος για την υπόθεση του ΕΛΑ, Μιχάλης Κασσίμης.";
     case 281: // 7 October
                     return "1911 - Οι Ζαπατίστας κατακτούν το Axochiapan, Morelos, από τις κυβερνητικές δυνάμεις κατά τη διάρκεια της Μεξικανικής Επανάστασης.";
     case 282: // 8 October
                     return "1982 - Η Πολωνία θέτει εκτός νόμου την Αλληλεγγύη και όλα τα συνδικάτα.";
     case 283: // 9 October
                     return "1967 - Δολοφονείται για απόπειρα υποκίνησης επανάστασης στη Βολιβία ο Αργεντινός μαρξιστής γιατρός Ερνέστο Τσε Γκεβάρα.";
     case 284: // 10 October
                     return "1935 - Καταλύεται με στρατιωτικό πραξικόπημα το δημοκρατικό πολίτευμα στην Ελλάδα.";
     case 285: // 11 October
                     return "1917 - Γάλλοι αναρχικοί καταδικάζονται σε ποινές φυλάκισης ενός έως τριών ετών για τη δημοσίευση ενός μυστικού τεύχους της εφημερίδας Le Libertaire.";
     case 286: // 12 October
                     return "1909 - Ο Καταλανός εκπαιδευτικός Francesc Ferrer i Guardia εκτελείται από εκτελεστικό απόσπασμα κατά τη διάρκεια της Τραγικής Εβδομάδας.";
     case 287: // 13 October
                     return "1944 - Ο ΕΛΑΣ νικά τους Γερμανούς στη μάχη της Ηλεκτρικής, διασώζοντας το εργοστάσιο παραγωγής ηλεκτρισμού στο Κερατσίνι.";
     case 288: // 14 October
                     return "1982 - Η Litton Industries βομβαρδίζεται από την Direct Action στο Τορόντο του Καναδά.";
     case 289: // 15 October
                     return "1920 - Ο Ιταλός αναρχικός και συγγραφέας Ερρίκο Μαλατέστα συλλαμβάνεται για σχέση με εργατικές καταλήψεις εργοστασίων του Μιλάνου.";
     case 290: // 16 October
                     return "1998 - Συλλαμβάνεται στο Λονδίνο ο άλλοτε δικτάτορας της Χιλής, Αουγούστο Πινοσέτ.";
     case 291: // 17 October
                     return "1941 - Σφαγή των Κερδυλίων: Οι Γερμανοί εκτελούν 250 κατοίκους των χωριών Ανω και Κάτω Κερδύλια της Ανατολικής Μακεδονίας σε αντίποινα για το φόνο ενός Γερμανού στρατιώτη.";
     case 292: // 18 October
                     return "1944 - Mαχητές του ΕΛΑΣ υπό τον Άρη Βελουχιώτη απελευθερώνουν τη Λαμία από τα στρατεύματα της ναζιστικής κατοχής.";
     case 293: // 19 October
                     return "1960 - Η κυβέρνηση των Η.Π.Α. επιβάλλει εμπορικό εμπάργκο κατά της Κούβας.";
     case 294: // 20 October
                     return "1905 - Προκηρύσσεται γενική απεργία κατά τη διάρκεια της Ρωσικής Επανάστασης του 1905.";
     case 295: // 21 October
                     return "1921 - Η Ευρώπη βλέπει μαζικές διαδηλώσεις για την υποστήριξη των φυλακισμένων αναρχικών Sacco και Vanzetti";
     case 296: // 22 October
                     return "1956 - Ουγγρική Επανάσταση: Προλετάριοι εργάτες  αρνούνται να υπακούσουν στους διευθυντές τους, ζητώντας αντ &#39;αυτού την εργατική αυτοδιαχείριση.";
     case 297: // 23 October
                     return "1974 - Οι πρωτεργάτες του πραξικοπήματος της 21ης Απριλίου συλλαμβάνονται και εκτοπίζονται στην Τζια.";
     case 298: // 24 October
                     return "1929 - Μαύρη Πέμπτη: Κραχ στο χρηματιστήριο της Νέας Υόρκης.";
     case 299: // 25 October
                     return "1806 - Γεννιέται ο Γερμανός μεταχεγκελιανός φιλόσοφος Μαξ Στίρνερ.";
     case 300: // 26 October
                     return "1961 - Εκλογές βίας και νοθείας: Ο Στέφανος Βελδεμίρης, στέλεχος της νεολαίας της ΕΔΑ, δολοφονείται από χωροφύλακα.";
     case 301: // 27 October
                     return "2006 - Ο ακτιβιστής Μπραντ Γουίλ πυροβολείται κατά τη διάρκεια των διαδηλώσεων στην Οαχάκα στο Μεξικό.";
     case 302: // 28 October
                     return "1954 - Φεύγει από την ζωή ο Μεξικανός δημοσιογράφος και εκδότης Ενρίκε Φλόρες Μαγκόν.";
     case 303: // 29 October
                     return "2004 - Στη Ρώμη, οι Ευρωπαίοι ηγέτες υπογράφουν τη Συνθήκη που εγκαθιδρύει το πρώτο Ευρωπαϊκό Σύνταγμα.";
     case 304: // 30 October
                     return "1988 - Φεύγει από την ζωή ο ποιητής Τάσος Λειβαδίτης.";
     case 305: // 31 October
                     return "1926 - Απόπειρα δολοφονίας κατά του Μπενίτο Μουσολίνι πραγματοποιείται από τον Αντέο Ζαμπόνι.";
     case 306: // 1 November
                     return "1897 - Ηνωμένες Πολιτείες: Ιδρύεται η Αποικία Ισότητας στην κομητεία Skagit της Ουάσιγκτον.";
     case 307: // 2 November
                     return "1789 - Γαλλική Επανάσταση: Εθνικοποιείται η περιουσία της εκκλησίας.";
     case 308: // 3 November
                     return "1979 - Μέλη του Αμερικανικού ναζιστικού κόμματος και της Κου Κλουξ Κλαν επιτίθενται σε διαδήλωση διαμαρτυρίας σκοτώνοντας 5 πολίτες και τραυματίζοντας άλλους 11.";
     case 309: // 4 November
                     return "1936 - Η Εθνική Συνομοσπονδία Εργασίας (CNT) προσχωρεί στην κυβέρνηση της Ισπανίας.";
     case 310: // 5 November
                     return "2011 - Χιλή: Η NANGU κάνει την πρώτη της επίθεση σε υποκατάστημα τράπεζας στη Vitacura.";
     case 311: // 6 November
                     return "1944 - Στις Η.Π.Α. παράγεται για πρώτη φορά πλουτώνιο, το οποίο θα χρησιμοποιηθεί στη συνέχεια στην ατομική βόμβα που θα πέσει στο Ναγκασάκι.";
     case 312: // 7 November
                     return "1910 - Φεύγει από την ζωή ο Ρώσσος συγγραφέας Λέων Τολστόι.";
     case 313: // 8 November
                     return "1919 - Ουκρανικός Πόλεμος της Ανεξαρτησίας: Ο Επαναστατικός Αντάρτικος Στρατός σκοτώνει 136 Μενονίτες στη σφαγή του Άιχενφελντ.";
     case 314: // 9 November
                     return "1921 - Ιδρύεται το ιταλικό Εθνικό Φασιστικό Κόμμα.";
     case 315: // 10 November
                     return "1924 - Συγκρούσεις στην Καβάλα μεταξύ καπνεργατών, στρατού και χωροφυλακής. Σκοτώνονται μία εργάτρια κι ένας αξιωματικός της χωροφυλακής.";
     case 316: // 11 November
                     return "1990 - Φεύγει από την ζωή ο ποιητής Γιάννης Ρίτσος.";
     case 317: // 12 November
                     return "1912 - Ο πρωθυπουργός της Ισπανίας José Canalejas δολοφονείται από τον Manuel Pardiñas στη Μαδρίτη.";
     case 318: // 13 November
                     return "1995 - Η πόλη Τζενίν είναι η πρώτη πόλη της Δυτικής Όχθης που παραδίδεται στους Παλαιστίνιους, ύστερα από 28 χρόνια ισραηλινής κατοχής.";
     case 319: // 14 November
                     return "1990 - Έπειτα από 28 ημέρες, λαμβάνει τέλος η μεγαλύτερη εξέγερση κρατουμένων στα ελληνικά χρονικά στις φυλακές Κορυδαλλού. 19 κρατούμενοι καταφέρνουν να αποδράσουν.";
     case 320: // 15 November
                     return "1973 - Η εξέγερση του Πολυτεχνείου Αθηνών κερδίζει λαϊκή υποστήριξη και το σύνθημα Ψωμί-Παιδεία-Ελευθερία διαδίδεται.";
     case 321: // 16 November
                     return "1980 - Κατά τη διάρκεια της πορείας για την επέτειο του Πολυτεχνείου δολοφονείται από την αστυνομία η Σταματίνα Κανελλοπούλου και χτυπιέται θανάσιμα ο Ιάκωβος Κουμής.";
     case 322: // 17 November
                     return "1973 - Η εξέγερση του Πολυτεχνείου Αθηνών καταστέλλεται βίαια από το στρατιωτικό καθεστώς, σκοτώνοντας 24 φοιτητές.";
     case 323: // 18 November
                     return "1943 - 440 αεροπλάνα της βρετανικής Βασιλικής Πολεμικής Αεροπορίας (RAF) βομβαρδίζουν το Βερολίνο.";
     case 324: // 19 November
                     return "1915 - Ο τραγουδοποιός και μέλος του Industrial Workers of the World Joe Hill εκτελείται από την πολιτεία της Γιούτα.";
     case 325: // 20 November
                     return "1936 - Ισπανικός Εμφύλιος Πόλεμος: Ο Ισπανός αναρχοσυνδικαλιστής Buenaventura Duruti σκοτώνεται από σφαίρα στην καρδιά του.";
     case 326: // 21 November
                     return "1927 - Απεργοί ανθρακωρύχοι στο Κολοράντο δέχονται επίθεση με πολυβόλα από αστυνομικούς με πολιτικά ρούχα.";
     case 327: // 22 November
                     return "1963 - Δολοφονείται στο Ντάλας ο πρόεδρος των ΗΠΑ, Τζον Φιτζέραλντ Κένεντι.";
     case 328: // 23 November
                     return "1988 - Σκάνδαλο Κοσκωτά: Ο πρόεδρος του Ολυμπιακού και της Τράπεζας Κρήτης, Γιώργος Κοσκωτάς, συλλαμβάνεται από το FBI στις ΗΠΑ για χρέη προς το αμερικάνικο δημόσιο.";
     case 329: // 24 November
                     return "1898 - Ξεκινά η Διεθνής Διάσκεψη της Ρώμης για την Κοινωνική Άμυνα κατά των Αναρχικών.";
     case 330: // 25 November
                     return "1947 - Μακαρθισμός: Δημιουργείται η Μαύρη Λίστα του Χόλυγουντ.";
     case 331: // 26 November
                     return "1943 - Οι γερμανικές δυνάμεις κατοχής εκτελούν 118 Έλληνες ομήρους στο Μονοδένδρι Λακωνίας.";
     case 332: // 27 November
                     return "1978 - Ιδρύεται στην Τουρκία το Εργατικό Κόμμα του Κουρδιστάν (PKK).";
     case 333: // 28 November
                     return "1820 - Γεννιέται ο Γερμανός πολιτικός φιλόσοφος Φρίντριχ Ένγκελς.";
     case 334: // 29 November
                     return "1947 - Η Γενική Συνέλευση του Οργανισμού Ηνωμένων Εθνών εγκρίνει σχέδιο για την κατάτμηση της Παλαιστίνης.";
     case 335: // 30 November
                     return "1943 - Πογκρόμ κατά των αναπήρων: Tα κατοχικά τάγματα ασφαλείας στην Αθήνα εκτελούνε 283 ανάπηρους πολέμου.";
     case 336: // 1 December
                     return "1955 - Στο Μοντγκόμερι η μοδίστρα Ρόζα Παρκς αρνείται να παραχωρήσει σ&#39; έναν λευκό τη θέση της στο λεωφορείο και συλλαμβάνεται.";
     case 337: // 2 December
                     return "1976 - Ο Φιντέλ Κάστρο γίνεται πρόεδρος της Κούβας.";
     case 338: // 3 December
                     return "1944 - Δεκεμβριανά: Πέφτει η πρώτη σφαίρα στα Δεκεμβριανά. Ο απολογισμός είναι 28 νεκροί και περίπου 100 τραυματίες.";
     case 339: // 4 December
                     return "1944 - Δεκεμβριανά: Ένοπλη επίθεση από Χίτες σε γενική απεργία. 40 νεκροί και 70 τραυματίες βάφουν με το αίμα τους τους αθηναϊκούς δρόμους.";
     case 340: // 5 December
                     return "1955 - Μποϋκοτάρισμα στα λεωφορεία του Μοντγκόμερι ως διαμαρτυρία κατά των φυλετικών διακρίσεων.";
     case 341: // 6 December
                     return "2008 - Δολοφονείται από την αστυνομία ο 15χρονος μαθητής Αλέξανδρος Γρηγορόπουλος.";
     case 342: // 7 December
                     return "2008 - Πορείες διαμαρτυρίας, καταλήψεις σχολείων και καταστροφές σε ολόκληρη την χώρα για τη δολοφονία Γρηγορόπουλου.";
     case 343: // 8 December
                     return "1987 - Ισραηλινό άρμα μάχης σκοτώνει τέσσερις Παλαιστίνιους και τραυματίζει άλλους επτά πυροδοτώντας την Πρώτη Ιντιφάντα.";
     case 344: // 9 December
                     return "1968 - Επτά νεκροί και 21 τραυματίες από έκρηξη σε στοά των λιγνιτωρυχείων Αλιβερίου.";
     case 345: // 10 December
                     return "1959 - Με κεντρικό σύνθημα να σπουδάσουν και οι φτωχοί, πραγματοποιείται φοιτητική διαδήλωση στον κέντρο της Αθήνας.";
     case 346: // 11 December
                     return "1792 - Ο Λουδοβίκος ΙΣΤ της Γαλλίας οδηγείται από τη Συμβατική Εθνοσυνέλευση σε δίκη για προδοσία.";
     case 347: // 12 December
                     return "1861 - Γεννιέται ο Γερμανός αναρχοσυνδικαλιστής Φριτς Κάτερ.";
     case 348: // 13 December
                     return "1943 - Οι Ναζί κατακτητές καταστρέφουν τα Καλάβρυτα κι εκτελούν και τους 1.101 άνδρες κατοίκους.";
     case 349: // 14 December
                     return "1976 - Η 17 Νοέμβρη δολοφονεί στην Αθήνα τον χουντικό βασανιστή Ευάγγελο Μάλλιο.";
     case 350: // 15 December
                     return "2008 - Κανόνι 50 δισεκατομμυρίων δολαρίων από τον αμερικανό χρηματιστή Μπέρναρντ Μάντοφ, στη μεγαλύτερη χρηματιστηριακή απάτη όλων των εποχών.";
     case 351: // 16 December
                     return "1974 - Φεύγει από την ζωή ο ποιητής, συγγραφέας, κριτικός και μεταφραστής Κώστας Βάρναλης.";
     case 352: // 17 December
                     return "1973 - Η Αμερικανική Ψυχιατρική Εταιρία, για πρώτη φορά, δεν συμπεριλαμβάνει στον κατάλογο με τις ψυχικές ασθένειες την ομοφυλοφιλία.";
     case 353: // 18 December
                     return "1916 - Τερματίζεται η Μάχη του Βερντέν που κράτησε 10 μήνες, με πολλές ανθρώπινες απώλειες, 543.000 Γάλλων και 434.000 Γερμανών.";
     case 354: // 19 December
                     return "1894 - Δίκη Ντρέιφους: Ο γαλλοεβραίος αξιωματικός Άλφρεντ Ντρέιφους κατηγορείται αδίκως για προδοσία που βασίζεται στην εβραϊκή καταγωγή του.";
     case 355: // 20 December
                     return "2001 - Οι διαδηλώσεις στο Αργεντινάζο καταστέλλονται βίαια από την αστυνομία, σκοτώνοντας δεκάδες. Ο Φερνάντο ντε λα Ρούα παραιτείται από πρόεδρος της Αργεντινής.";
     case 356: // 21 December
                     return "1907 - Ο χιλιανός στρατός σκοτώνει πάνω από 2.200 απεργούς εργάτες των ορυχείων νιτρικού νάτριου στο Ικίκε της Χιλής.";
     case 357: // 22 December
                     return "1907 - Γεννιέται ο ζωγράφος και εικονογράφος βιβλίων Φέρμιν Ρόκερ, γιος του αναρχοσυνδικαλιστή Ρούντολφ Ρόκερ.";
     case 358: // 23 December
                     return "1938 - Ισπανικός Εμφύλιος Πόλεμος: Οι εθνικιστικές δυνάμεις ξεκινούν την επίθεση στην Καταλονία.";
     case 359: // 24 December
                     return "1947 - Ξεκινά η μάχη της Κόνιτσας μεταξύ του Δημοκρατικού Στρατού Ελλάδας (ΔΣΕ) και του Εθνικού Στρατού.";
     case 360: // 25 December
                     return "1977 - Φεύγει από την ζωή ο Άγγλος ηθοποιός, σκηνοθέτης και συνθέτης Τσάρλι Τσάπλιν.";
     case 361: // 26 December
                     return "1997 - Φεύγει από την ζωή ο φιλόσοφος, οικονομολόγος και ψυχαναλυτής Κορνήλιος Καστοριάδης.";
     case 362: // 27 December
                     return "1947 - Η κυβέρνηση του Θεμιστοκλή Σοφούλη με αναγκαστικό νόμο κηρύσσει παράνομα το ΚΚΕ, το ΕΑΜ και την Εθνική Αλληλεγγύη. Ο κομμουνισμός θεωρείται ποινικό αδίκημα και όσοι προπαγανδίζουν τις αρχές του απειλούνται με ποινές, που φθάνουν ως το θάνατο.";
     case 363: // 28 December
                     return "2019 - Φεύγει από την ζωή ο πιανίστας και συνθέτης Θάνος Μικρούτσικος.";
     case 364: // 29 December
                     return "1939 - Η Γαλλίδα και φεμινίστρια και ψυχίατρος Madeleine Pelletier πεθαίνει φυλακισμένη σε άσυλο επειδή κατηγορήθηκε ότι έκανε άμβλωση.";
     case 365: // 30 December
                     return "1972 - Οι Ηνωμένες Πολιτείες Αμερικής σταματούν τον βομβαρδισμό του Βορείου Βιετνάμ.";
     case 366: // 31 December
                     return "1921 - Ιδρύεται στη Μόσχα η Κομμούνα Ζωής και Εργασίας.";
        // Add more cases for other specific days if needed
        default:
            return "Have a great day!";
    }
}

// Update the HTML elements with the current date and text based on date
document.getElementById("currentDate").innerText = getCurrentDate();
document.getElementById("textBasedOnDate").innerText = getTextBasedOnDate();